Terraform plan for __dev__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_dns_record_set.cc_ibo_redis_a_record will be created
  + resource "google_dns_record_set" "cc_ibo_redis_a_record" {
      + id           = (known after apply)
      + managed_zone = "ebo-dev-private-dns-managed-zone"
      + name         = "command-center.ibo.redis.commerce.internal."
      + project      = (known after apply)
      + rrdatas      = [
          + (known after apply),
        ]
      + ttl          = 300
      + type         = "A"
    }

  # module.command_center_ibo_redis.google_redis_instance.cache will be created
  + resource "google_redis_instance" "cache" {
      + alternative_location_id  = (known after apply)
      + auth_enabled             = true
      + auth_string              = (sensitive value)
      + authorized_network       = "https://www.googleapis.com/compute/v1/projects/ebo-dev-321910/global/networks/ebo-dev-network"
      + connect_mode             = "DIRECT_PEERING"
      + create_time              = (known after apply)
      + current_location_id      = (known after apply)
      + host                     = (known after apply)
      + id                       = (known after apply)
      + location_id              = (known after apply)
      + memory_size_gb           = 1
      + name                     = "command-center-redis"
      + persistence_iam_identity = (known after apply)
      + port                     = (known after apply)
      + project                  = (known after apply)
      + redis_version            = "REDIS_6_X"
      + region                   = "asia-south1"
      + reserved_ip_range        = "10.100.1.0/24"
      + server_ca_certs          = (known after apply)
      + tier                     = "BASIC"
      + transit_encryption_mode  = "DISABLED"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #419](https://github.com/ebomart/commerce-infrastructure/actions/runs/1771950767)